An alternative to NULL values in your database is to have data-type appropriate default values.

But if your database needs to store incomplete data, then NULL values can be appropriate if the default values will skew later analysis.

Select query with constraints on NULL values
SELECT column, another_column, …
FROM mytable
WHERE column IS/IS NOT NULL
AND/OR another_condition
AND/OR …;

In [1]:
import pandas as pd

In [2]:
import sqlite3
conn = sqlite3.connect('test.db')
print("Opened database successfully")

Opened database successfully

In [3]:
ret = conn.execute('''SELECT * FROM employees;''')
for r in ret:
    print(r)

('Engineer', 'Becky A.', '1e', 4)
('Engineer', 'Dan B.', '1e', 2)
('Engineer', 'Sharon F.', '1e', 6)
('Engineer', 'Dan M.', '1e', 4)
('Engineer', 'Malcom S.', '1e', 1)
('Artist', 'Tylar S.', '2w', 2)
('Artist', 'Sherman D.', '2w', 8)
('Artist', 'Jakob J.', '2w', 6)
('Artist', 'Lillia A.', '2w', 7)
('Artist', 'Brandon J.', '2w', 7)
('Manager', 'Scott K.', '1e', 9)
('Manager', 'Shirlee M.', '1e', 3)
('Manager', 'Daria O.', '2w', 6)

In [7]:
conn.execute('''INSERT INTO employees (role,name,years_employed) values('Engineer','Yancy I.',0);''')
conn.execute('''INSERT INTO employees (role,name,years_employed) values('Artist','Oliver P.',0);''')

In [8]:
ret = conn.execute('''SELECT * FROM employees;''')
for r in ret:
    print(r)

('Engineer', 'Becky A.', '1e', 4)
('Engineer', 'Dan B.', '1e', 2)
('Engineer', 'Sharon F.', '1e', 6)
('Engineer', 'Dan M.', '1e', 4)
('Engineer', 'Malcom S.', '1e', 1)
('Artist', 'Tylar S.', '2w', 2)
('Artist', 'Sherman D.', '2w', 8)
('Artist', 'Jakob J.', '2w', 6)
('Artist', 'Lillia A.', '2w', 7)
('Artist', 'Brandon J.', '2w', 7)
('Manager', 'Scott K.', '1e', 9)
('Manager', 'Shirlee M.', '1e', 3)
('Manager', 'Daria O.', '2w', 6)
('Engineer', 'Yancy I.', None, 0)
('Artist', 'Oliver P.', None, 0)

In [4]:
ret = conn.execute('''SELECT * FROM buildings;''')
for r in ret:
    print(r)

('1e', 24)
('1w', 32)
('2e', 16)
('2w', 20)

Find the name and role of all employees who have not been assigned to a building

In [5]:
ret = conn.execute('''SELECT name,role FROM employees where building is NULL;''')
for r in ret:
    print(r)

Find the names of the buildings that hold no employees

In [9]:
ret = conn.execute('''SELECT building_name FROM buildings left join employees on building_name=building where role is null;''')
for r in ret:
    print(r)

('1w', 32, None, None, None, None)
('2e', 16, None, None, None, None)